{
  "lesson": {
    "id": "1.1",
    "title": "Обзор экосистемы TON",
    "welcomeMessage": "Дорогие участники! Добро пожаловать на наш курс по разработке на блокчейне TON — в захватывающее путешествие в мир передовых технологий и децентрализованных приложений.",
    "courseObjectives": [
      "Честно пройти все уроки курса, решить предложенные задачи, тесты.",
      "Подписаться на наш официальный Telegram канал: (RU) https://t.me/ton_insights_ru"
    ],
    "welcomeText": "Желаем вам вдохновляющего обучения и множества проектов! Поехали!",
    "videoPlaceholder": "here must be video",
    "contentOverview": {
      "sections": [
        {
          "title": "Что вы теперь знаете",
          "items": [
            "Чем кастодиальные кошельки отличаются от некастодиальных.",
            "Блокчейн сам по себе является бэкендом для децентрализованных приложений.",
            "Всё в блокчейне, по сути, представляет собой смарт-контракты (децентрализованные обменники, токены, доменные имена)."
          ]
        },
        {
          "title": "Конспект урока",
          "content": "В этой части мы обсудим общую архитектуру, принципы построения и другие важные компоненты платформы TON."
        },
        {
          "title": "Что такое TON?",
          "content": "TON — это платформа для децентрализованных приложений, объединяющая пользователей, валидаторов и разработчиков самих приложений. Это больше, чем просто блокчейн.",
          "bulletPoints": [
            "пользователи, владеющие ассетами в TON;",
            "валидаторы, управляющие консенсусом сети;",
            "разработчики приложений, предоставляющие сервисы на основе сети."
          ]
        },
        {
          "title": "Кастодиальные и некастодиальные сервисы",
          "content": "Приложения и сервисы делятся на две группы: кастодиальные, некастодиальные.",
          "bulletPoints": [
            "Кастодиальные сервисы — это сервисы, управляемые той же стороной, что несет ответственность за средства, размещенные на этих сервисах.",
            "Некастодиальные сервисы – это сервисы, которые не хранят средства пользователей и оставляют их полностью под контролем владельцев."
          ],
          "warning": "Онлайн-биржи обычно являются кастодиальными, поскольку им нужно использовать средства с кошельков для того, чтобы гарантировать заявленный обмен."
        },
        {
          "title": "Централизованные и децентрализованные приложения",
          "bulletPoints": [
            "Централизованные приложения — это приложения, работающие на сервере.",
            "Децентрализованные приложения не требуют наличия сервера, а запускаются напрямую на смарт-контракте блокчейна."
          ]
        },
        {
          "title": "Что создают на основе блокчейна",
          "bulletPoints": [
            "Смарт-контракты лежат в основе децентрализованных бирж.",
            "Смарт-контракты лежат в основе токенов (валют, коллекционных токенов, служебных токенов).",
            "Смарт-контракты могут быть использованы для аукционов и доменных имен."
          ]
        }
      ]
    },
    "conclusion": "Экосистема TON объединяет кошельки, обменники, трейдеров и пользователей, взаимодействующих через смарт-контракты. Этот курс посвящен авторизованным смарт-контрактам, их развертыванию в TON, разработке дополнительных функций и взаимодействию между централизованными и децентрализованными приложениями."
  }
}
